kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
    app_eventbus_subscribe(panel_event_handler); // 订阅事件总线
    // 创建一个静态定时器用于读取adc值
    static StaticTimer_t ReadAdcStaticBuffer;
    static TimerHandle_t ReadAdcTimerHandle = NULL;
    // 创建一个定时器用于处理命令
    static StaticTimer_t PanelStaticBuffer;
    static TimerHandle_t PanleTimerHandle = NULL;

    // 集中处理adc
    ReadAdcTimerHandle = xTimerCreateStatic("ReadAdcTimer", 1, true, NULL, panel_read_adc, &ReadAdcStaticBuffer);
    // 集中状态机轮询
    PanleTimerHandle = xTimerCreateStatic("PanelTimer", 1, true, NULL, panel_proce_cmd, &PanelStaticBuffer);

    if (xTimerStart(PanleTimerHandle, 0) != true || xTimerStart(ReadAdcTimerHandle, 0) != true) {
        // 启动定时器(0表示不阻塞)
        APP_ERROR("timer_start error");
    }
    APP_PRINTF("%s[%d]\n", __func__, KEY_NUMBER);
}

static void panel_read_adc(TimerHandle_t xTimer)
{
    my_adc_value.vol = ADC_TO_VOL(app_get_adc_value()[0]);
    process_panel_adc(my_panel_status, &my_common_panel, &my_adc_value, false);
    if (my_common_panel.led_filck) {
        process_led_flicker(&my_common_panel, false);
    }
    #if defined PANEL_8KEY_A13
    my_adc_value_ex.vol = ADC_TO_VOL(app_get_adc_value()[1]);
    process_panel_adc(my_panel_status_ex, &my_common_panel_ex, &my_adc_value_ex, true);
    if (my_common_panel_ex.led_filck) {
        process_led_flicker(&my_common_panel_ex, true);
    }
    #endif
}

static void process_panel_adc(ADC_PARAMS)
{
    // APP_PRINTF("%d\n", adc_value->vol);
    for (uint8_t i = 0; i < KEY_NUMBER; i++) {
        panel_status_t *p_status = &temp_status[i];
        if (adc_value->vol < p_status->vol_range.min || adc_value->vol > p_status->vol_range.max) {
            if (adc_value->vol >= MIN_VOL && adc_value->vol <= MAX_VOL) {
                p_status->key_press         = false;
                temp_common->key_long_press = false;
                temp_common->key_long_count = 0;
            }
            continue;
        }
        // 填充 vol_buf
        adc_value->vol_buf[adc_value->buf_idx++] = adc_value->vol;
        if (adc_value->buf_idx < ADC_VOL_NUMBER) {
            continue;
        }
        adc_value->buf_idx = 0; // vol_buf 被填充满(下标置0)
        uint16_t new_value = app_calculate_average(adc_value->vol_buf, ADC_VOL_NUMBER);
        if (new_value < p_status->vol_range.min || new_value > p_status->vol_range.max) {
            continue; // 检查平均值是否在有效范围
        }
        if (!p_status->key_press && !temp_common->enter_config) { // 处理按键按下
            p_status->key_status ^= 1;
            const bool is_special = p_status->relay_short;
            app_send_cmd(i, (is_special ? 0x00 : p_status->key_status), PANEL_HEAD, (is_special ? SPECIAL_CMD : COMMON_CMD), is_ex);

            p_status->key_press         = true;
            temp_common->key_long_press = true;
            temp_common->key_long_count = 0;
            continue;
        }
        // 处理长按
        if (temp_common->key_long_press && ++temp_common->key_long_count >= LONG_PRESS) {
            app_send_cmd(0, 0, APPLY_CONFIG, 0x00, is_ex);
            temp_common->key_long_press = false;
        }
    }
}

static void process_led_flicker(common_panel_t *common_panel, bool is_ex_panel)
{
    common_panel->led_filck_count++;
    if (common_panel->led_filck_count <= 500) {
        panel_ctrl_led_all(false, is_ex_panel);
    } else if (common_panel->led_filck_count <= 1000) {
        panel_ctrl_led_all(true, is_ex_panel);
    } else if (common_panel->led_filck_count <= 1500) {
        panel_ctrl_led_all(false, is_ex_panel);
    } else {
        common_panel->led_filck_count = 0;
        common_panel->led_filck       = false;
        panel_ctrl_led_all(true, is_ex_panel);
    }
}

static void panel_proce_cmd(TimerHandle_t xTimer)
{
    const panel_cfg_t *temp_cfg = app_get_panel_cfg();
    process_exe_status(temp_cfg, my_panel_status, &my_common_panel);

    #if defined PANEL_8KEY_A13
    const panel_cfg_t *temp_cfg_ex = app_get_panel_cfg_ex();
    process_exe_status(temp_cfg_ex, my_panel_status_ex, &my_common_panel_ex);
    #endif
}

static void process_exe_status(TIMER_PARAMS)
{
    if (temp_common->bl_close) { // 处理背光总关
        if (++temp_common->bl_delay_count >= 1000) {
            panel_backlight_status(temp_cfg, temp_status, false);
            temp_common->bl_close       = false;
            temp_common->bl_delay_count = 0;
        }
    }

    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_status->led_w_short) { // 白灯短亮逻辑
            if (p_status->led_w_short_count++ == 0) {
                p_status->led_w_open = true;
            }
            if (p_status->led_w_short_count >= SHORT_TIME_LED) {
                p_status->led_w_open        = false;
                p_status->led_w_short       = false;
                p_status->led_w_short_count = 0;
            }
        }
        if (p_status->relay_short) { // 继电器短开逻辑
            if (p_status->relay_open_count++ == 0) {
                p_status->relay_open = true;
            }
            if (p_status->relay_open_count >= SHORT_TIME_RELAY) {
                p_status->relay_open       = false;
                p_status->relay_short      = false;
                p_status->led_w_open       = false;
                p_status->key_status       = false;
                p_status->relay_open_count = 0;
            }
        }
        if (p_status->led_w_open != p_status->led_w_last) { // 白灯状态更新
            // zero_set_gpio(p_cfg->led_w_pin, p_status->led_w_open);
            APP_SET_GPIO(p_cfg->led_w_pin, p_status->led_w_open);
            p_status->led_w_last = p_status->led_w_open;
            panel_backlight_status(temp_cfg, temp_status, true);
        }

        if (p_status->relay_open != p_status->relay_last) { // 继电器状态更新
            for (uint8_t i = 0; i < RELAY_NUMBER; i++) {
                if (!app_gpio_equal(p_cfg->relay_pin[i], DEF)) { // 只操作勾选的继电器
                    zero_set_gpio(p_cfg->relay_pin[i], p_status->relay_open);
                    // APP_SET_GPIO(p_cfg->relay_pin[i], p_status->relay_open);
                }
            }
            p_status->relay_last = p_status->relay_open;
            // APP_PRINTF("%d %d %d %d\n", APP_GET_GPIO(PB12), APP_GET_GPIO(PB13), APP_GET_GPIO(PB14), APP_GET_GPIO(PB15));
        }
    });
}

static void panel_data_cb(at_frame_t *data)
{
    // 0:固定码,1:按键功能,2:操作指令,3:分组,4:总关/场景区域,5:校验码,6:按键权限,7:场景分组
    APP_PRINTF_BUF("[RECV]", data->data, data->length);
    // APP_PRINTF("len:%d\n", data->length);
    const panel_cfg_t *temp_cfg = app_get_panel_cfg();
    process_cmd_check(data, temp_cfg, my_panel_status);

