kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
    #if defined PANEL_8KEY_A13
    const panel_cfg_t *temp_cfg_ex = app_get_panel_cfg_ex();
    process_cmd_check(data, temp_cfg_ex, my_panel_status_ex);
    #endif
}

static void process_cmd_check(FUNC_PARAMS)
{
    switch (data->data[1]) {
        case ALL_CLOSE: // 总关
            panel_all_close(FUNC_ARGS);
            break;
        case ALL_ON_OFF: // 总开关
            panel_all_on_off(FUNC_ARGS);
            break;
        case CLEAN_ROOM: // 清理房间
            panel_clean_room(FUNC_ARGS);
            break;
        case DND_MODE: // 勿扰模式
            panel_dnd_mode(FUNC_ARGS);
            break;
        case LATER_MODE: // 请稍后
            panel_later_mode(FUNC_ARGS);
            break;
        case CHECK_OUT: // 退房
            panel_chect_out(FUNC_ARGS);
            break;
        case SOS_MODE: // 紧急呼叫
            panel_sos_mode(FUNC_ARGS);
            break;
        case SERVICE: // 请求服务
            panel_service(FUNC_ARGS);
            break;
        case CURTAIN_OPEN: // 窗帘开
            panel_curtain_open(FUNC_ARGS);
            break;
        case CURTAIN_CLOSE: // 窗帘关
            panel_curtain_close(FUNC_ARGS);
            break;
        case SCENE_MODE: // 场景模式
            panel_scene_mode(FUNC_ARGS);
            break;
        case LIGHT_MODE: // 灯控模式
            panel_light_mode(FUNC_ARGS);
            break;
        case NIGHT_LIGHT: // 夜灯
            panel_night_light(FUNC_ARGS);
            break;
        case LIGHT_UP:
            break;
        case LIGHT_DOWN:
            break;
        case DIMMING_3:
            break;
        case DIMMING_4:
            break;
        case UNLOCKING:
            break;
        case BLUETOOTH:
            break;
        case CURTAIN_STOP: // 窗帘停
            panel_curtain_stop(FUNC_ARGS);
            break;
        case VOLUME_ADD:
            break;
        case VOLUME_SUB:
            break;
        case PLAY_PAUSE:
            break;
        case NEXT_SONG:
            break;
        case LAST_SONG:
            break;
        default:
            return;
    }
}

static void panel_ctrl_led_all(bool led_state, bool is_ex)
{
    panel_status_t *temp = NULL;
    #ifndef PANEL_8KEY_A13
    temp = my_panel_status;
    #endif
    #if defined PANEL_8KEY_A13
    temp = is_ex ? my_panel_status_ex : my_panel_status;
    #endif
    for (uint8_t i = 0; i < KEY_NUMBER; i++) {
        temp[i].led_w_open = led_state;
    }
}

static void panel_event_handler(event_type_e event, void *params)
{
    switch (event) {
        case EVENT_ENTER_CONFIG: {
            panel_ctrl_led_all(true, false);
            my_common_panel.enter_config = true;
        } break;
        case EVENT_EXIT_CONFIG: {
            panel_ctrl_led_all(false, false);
            my_common_panel.enter_config = false;
            NVIC_SystemReset(); // 退出"配置模式"后触发软件复位
        } break;
        case EVENT_SAVE_SUCCESS: {
            my_common_panel.led_filck = true;
        } break;
    #if defined PANEL_8KEY_A13
        case EVENT_ENTER_CONFIG_EX:
            panel_ctrl_led_all(true, true);
            my_common_panel_ex.enter_config = true;
            break;
        case EVENT_EXIT_CONFIG_EX: {
            panel_ctrl_led_all(false, true);
            my_common_panel_ex.enter_config = false;
            NVIC_SystemReset();
        } break;
        case EVENT_SAVE_SUCCESS_EX: {
            my_common_panel_ex.led_filck = true;
        } break;
    #endif
        case EVENT_RECEIVE_CMD: {
            at_frame_t *frame = (at_frame_t *)params;
            panel_data_cb(frame);
        } break;
        default:
            return;
    }
}

// 执行上电参数(迎宾)
static void panel_power_status(void)
{
    process_exe_power(app_get_panel_cfg(), my_panel_status);
    #if defined PANEL_8KEY_A13
    process_exe_power(app_get_panel_cfg_ex(), my_panel_status_ex);
    #endif
}

static void process_exe_power(const panel_cfg_t *temp_cfg, panel_status_t *temp_status)
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (!BIT3(p_cfg->perm)) {
            continue; // 权限是否勾选"迎宾"
        }
        switch (p_cfg->func) {
            case LIGHT_MODE:
                panel_fast_exe(p_status, 0b00010110 | 0x01);
                break;
            case SCENE_MODE: // 场景模式,不开白灯
                panel_fast_exe(p_status, 0b00010000 | 0x01);
                break;
            default:
                break;
        }
    });
}

static void panel_fast_exe(panel_status_t *temp_fast, uint8_t flag)
{
    // 0:data->data[2];1:key_status;2:led_w_open,3:led_w_short,4:relay_open;5:relay_short;6:保留;7:保留

    if (BIT1(flag)) {
        temp_fast->key_status = BIT0(flag);
    }
    if (BIT2(flag)) {
        temp_fast->led_w_open = BIT0(flag);
    }
    if (BIT3(flag)) {
        temp_fast->led_w_short = true; // 短亮会快速熄灭,无需持续状态,故而不受data->data[2]控制
    }
    if (BIT4(flag)) {
        temp_fast->relay_open = BIT0(flag);
    }
    if (BIT5(flag)) {
        temp_fast->relay_short      = BIT0(flag);
        temp_fast->relay_open_count = 0; // 继电器短开计数器提前置0
    }
}

static void panel_backlight_status(const panel_cfg_t *temp_cfg, panel_status_t *temp_status, bool status)
{
    #if defined PANEL_8KEY_A13 || defined PANEL_4KEY_A13 || defined PANEL_6KEY_A13
    for (uint8_t i = 0; i < KEY_NUMBER; i++) {
        if (status) {
            app_set_pwm_fade(temp_cfg[i].led_y_pin, temp_status[i].led_w_open ? 0 : 500, 500);
        } else {
            app_set_pwm_fade(temp_cfg[i].led_y_pin, 0, 3000);
        }
    }
    #endif
    #if defined PANEL_6KEY_A11
    uint8_t no_w_led = 0;
    for (uint8_t i = 0; i < KEY_NUMBER; i++) {
        no_w_led += temp_status[i].led_w_open;
    }
    if (status) {
        app_set_pwm_fade(PA8, no_w_led ? 500 : 50, 3000);
    } else {
        app_set_pwm_fade(PA8, 0, 3000);
    }
    #endif
}

/* ***************************************** 处理按键类型 ***************************************** */
static void panel_all_close(FUNC_PARAMS) // 总关
{
    if (BIT1(data->data[6])) {
        my_common_panel.bl_close = true;
    #if defined PANEL_8KEY_A13
        my_common_panel_ex.bl_close = true;
    #endif
    }
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (!BIT5(p_cfg->perm)) {
            continue; // 无"睡眠"权限,跳过
        }
        if (H_BIT(data->data[4]) != 0xF &&                // 非全局指令
            H_BIT(data->data[4]) != H_BIT(p_cfg->area)) { // 分区不匹配
            continue;
        }
        switch (p_cfg->func) {
            case ALL_CLOSE:
                if (data->data[3] == p_cfg->group) {
                    panel_fast_exe(p_status, 0b00011010 | (data->data[2] & 0x01));
                }
                break;
            case NIGHT_LIGHT:
            case DND_MODE:
            case ALL_ON_OFF:
                panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
                break;
            case SCENE_MODE:
            case LIGHT_MODE:

            case CLEAN_ROOM:
                panel_fast_exe(p_status, 0b00010110 | 0x00);
                break;
            case CURTAIN_CLOSE: // 勾选"总关"的窗帘关
                PROCESS_INNER(temp_cfg, temp_status, {
                    if (p_cfg_ex->func != CURTAIN_OPEN ||
                        p_cfg_ex->group != p_cfg->group) {
                        continue;
                    }
                    panel_fast_exe(p_status_ex, 0b00110000 | 0x00);
                });
                panel_fast_exe(p_status, 0b00101010 | 0x01);
                break;
            default:
                break;
        }
    });
}

static void panel_all_on_off(FUNC_PARAMS) // 总开关
{
    if (BIT1(data->data[6])) {
        my_common_panel.bl_close = true;
    #if defined PANEL_8KEY_A13
        my_common_panel_ex.bl_close = true;
    #endif
    }
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (!BIT0(p_cfg->perm)) {
            continue; // 无"总开关"权限跳过
        }
        if (H_BIT(data->data[4]) != 0xF &&                // 分区不匹配
            H_BIT(data->data[4]) != H_BIT(p_cfg->area)) { // 非全局指令
            continue;
        }
        switch (p_cfg->func) {
            case ALL_ON_OFF:
                if (data->data[3] == p_cfg->group) {
                    if (BIT4(p_cfg->perm) && BIT6(p_cfg->perm)) { //"只开" + "取反"
                        panel_fast_exe(p_status, 0b00011010 | 0x00);
                    } else if (BIT4(p_cfg->perm)) { // "只开"
                        panel_fast_exe(p_status, 0b00010110 | 0x01);
                    } else if (BIT6(p_cfg->perm)) { // "取反"
                        panel_fast_exe(p_status, 0b00010110 | (~data->data[2] & 0x01));
                    } else { // 默认
                        panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
                    }
                }
                break;
            case DND_MODE:
                panel_fast_exe(p_status, 0b00010110 | (~data->data[2] & 0x01));
                break;
            case LIGHT_MODE:
            case SCENE_MODE:
            case CLEAN_ROOM:
            case NIGHT_LIGHT:
                if (BIT7(p_cfg->perm) && !data->data[2]) { // 勾选了"不总开",则只受"总开关"的关控制
                    panel_fast_exe(p_status, 0b00010110 | 0x00);
                } else if (!BIT7(p_cfg->perm)) { // 勾选"不总开",则正常动作
                    panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
                }
                break;
            case ALL_CLOSE: // 勾选"总开关"的"总关"不执行闪烁
                panel_fast_exe(p_status, 0b00010010 | (data->data[2] & 0x01));
                break;
            case CURTAIN_CLOSE: // 勾选"总开关"的窗帘关
                if (!data->data[2]) {
                    PROCESS_INNER(temp_cfg, temp_status, {
                        if (p_cfg_ex->func != CURTAIN_OPEN ||
                            p_cfg_ex->group != p_cfg->group) {
                            continue;
                        }
                        panel_fast_exe(p_status_ex, 0b00110000 | 0x00);
                    });
                    panel_fast_exe(p_status, 0b00101010 | 0x01);
                }
                break;
            case CURTAIN_OPEN: // 勾选"总开关"的窗帘开
                if (data->data[2]) {
                    PROCESS_INNER(temp_cfg, temp_status, {
                        if (p_cfg_ex->func != CURTAIN_CLOSE ||
                            p_cfg_ex->group != p_cfg->group) {
                            continue;
                        }
                        panel_fast_exe(p_status_ex, 0b00110000 | 0x00);
                    });
                    panel_fast_exe(p_status, 0b00101010 | 0x01);
                }
                break;
            default:
                break;
        }
    });
}

static void panel_clean_room(FUNC_PARAMS) // 清理房间
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func != CLEAN_ROOM ||
            (data->data[3] != p_cfg->group && data->data[3] != 0xFF)) {
            continue;
        }
        if (data->data[2]) {
            PROCESS_INNER(temp_cfg, temp_status, {
                if (p_cfg_ex->func != DND_MODE ||
                    (data->data[3] != p_cfg_ex->group && data->data[3] != 0xFF)) {
                    continue;
                }
                panel_fast_exe(p_status_ex, 0b00010110 | (~data->data[2] & 0x01));
            });
        }
        panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
    });
}

static void panel_dnd_mode(FUNC_PARAMS) // 勿扰模式
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func != DND_MODE ||
            (data->data[3] != p_cfg->group && data->data[3] != 0xFF)) {
            continue;
        }
        if (data->data[2]) {
            PROCESS_INNER(temp_cfg, temp_status, {
                if (p_cfg_ex->func != CLEAN_ROOM ||
                    (data->data[3] != p_cfg_ex->group && data->data[3] != 0xFF)) {
                    continue;
                }
                panel_fast_exe(p_status_ex, 0b00010110 | (~data->data[2] & 0x01));
            });
        }
        panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
    });
}

static void panel_later_mode(FUNC_PARAMS) // 请稍后
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func != LATER_MODE ||
            (data->data[3] != p_cfg->group && data->data[3] != 0xFF)) {
            continue;
        }
        panel_fast_exe(p_status, 0b00100110 | (data->data[2] & 0x01));
    });
}

static void panel_chect_out(FUNC_PARAMS) // 退房
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func != CHECK_OUT ||
            (data->data[3] != p_cfg->group && data->data[3] != 0xFF)) {
            continue;
        }
        panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
    });
}

static void panel_sos_mode(FUNC_PARAMS) // 紧急呼叫
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func != SOS_MODE ||
            (data->data[3] != p_cfg->group && data->data[3] != 0xFF)) {
            continue;
        }
        panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
    });
}

static void panel_service(FUNC_PARAMS) // 请求服务
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func != SERVICE ||
            (data->data[3] != p_cfg->group && data->data[3] != 0xFF)) {
            continue;
        }
        panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
    });
}

